[
  {
    "date": "Tue, Sep 2 10:00 AM",
    "currency": "USD",
    "report": "ISM Manufacturing PMI",
    "actual": 48.7,
    "forecast": 49.0,
    "previous": 48.0,
    "marketImpact": "Actual 50 سے نیچے → Economy contraction",
    "dollar": "Weak (down)",
    "gold": "Strong (up)",
    "riskMode": "❌ Risk Off",
    "imageId": "1Qu-2SyiSHZR_sWj6jelmFvTciu14CkSl",
    "explanation": "ISM Manufacturing PMI وہ رپورٹ ہے جو Manufacturing Sector کی حالت بتاتی ہے۔ اگر یہ 50 سے اوپر ہو تو Growth (Expansion) اور اگر 50 سے نیچے ہو تو Contraction (کمزوری) کو ظاہر کرتا ہے۔\nاس بار ISM Manufacturing PMI کا نتیجہ Forecast (49.0) سے کم یعنی 48.7 آیا۔ یہ ظاہر کرتا ہے کہ امریکہ کی Manufacturing Sector مزید دباؤ میں ہے اور Growth سست ہو رہی ہے۔\nDollar (USD): کمزور ہوا کیونکہ Fed پر دباؤ بڑھ گیا کہ Interest Rate نہ بڑھائے۔\nGold (XAU): اوپر گیا کیونکہ سرمایہ کار Safe Haven کی طرف گئے۔\nRisk Mode: مارکیٹ کا رجحان Risk Off کی طرف گیا کیونکہ انویسٹر نے Stocks & Currencies بیچ کر Gold اور Bonds خریدے۔"
  },
  {
    "date": "Wed, Sep 3 2025 10:00 AM",
    "currency": "USD",
    "report": "JOLTS Job Openings",
    "actual": 7.18,
    "forecast": 7.38,
    "previous": 7.36,
    "marketImpact": "Forecast اور Previous سے کم → لیبر مارکیٹ دباؤ میں",
    "dollar": "Weak (down)",
    "gold": "Strong (up)",
    "riskMode": "❌ Risk Off",
    "imageId": "1Qry9Z0quIO0cFsJEumxFzEFBYjLv0KXh",
    "explanation": "JOLTS Job Openings وہ رپورٹ ہے جو دکھاتی ہے کہ امریکہ میں کتنی نئی نوکریوں کے مواقع موجود ہیں۔ زیادہ جاب اوپننگز کا مطلب ہے کہ لیبر مارکیٹ مضبوط ہے، جبکہ کم جاب اوپننگز کمزوری کو ظاہر کرتی ہیں۔\nاس بار JOLTS Job Openings کا نتیجہ Actual 7.18M آیا، جو Forecast (7.38M) اور Previous (7.36M) دونوں سے کم ہے۔ اس سے ظاہر ہوتا ہے کہ امریکی لیبر مارکیٹ میں سست روی ہے اور نوکریوں کے مواقع کم ہو رہے ہیں۔\nDollar (USD): کمزور ہوا کیونکہ کم نوکریوں کے مواقع ظاہر کرتے ہیں کہ معیشت سست ہے اور Fed پر دباؤ ہے کہ Interest Rates میں اضافہ نہ کرے۔\nGold (XAU): اوپر گیا کیونکہ سرمایہ کاروں نے Safe Haven یعنی Gold اور Bonds کو ترجیح دی۔\nRisk Mode: مارکیٹ کا رجحان Risk Off کی طرف گیا کیونکہ انویسٹر نے خطرناک اثاثے (Stocks, Currencies) بیچ کر محفوظ سرمایہ کاری کو چُنا۔"
  },
  {
    "date": "Thu, Sep 4 2025 8:15 AM",
    "currency": "USD",
    "report": "ADP Non-Farm Employment Change",
    "actual": "54K",
    "forecast": "73K",
    "previous": "106K",
    "marketImpact": "Actual Forecast سے کم → Labor Market Weakness",
    "dollar": "Weak (down)",
    "gold": "Strong (up)",
    "riskMode": "❌ Risk Off",
    "imageId": "1DU3Mm9KXG5BMNzOivcYPFIy9B0NgNawt",
    "explanation": "ADP Non-Farm Employment Change رپورٹ امریکہ کے پرائیویٹ سیکٹر میں پیدا ہونے والی نئی نوکریوں کی تعداد بتاتی ہے۔\nزیادہ عدد مضبوط لیبر مارکیٹ (Strong Economy) کو ظاہر کرتا ہے، جب کہ کم عدد کمزوری کی نشانی ہوتی ہے۔\nاس بار نتیجہ 54K آیا جو Forecast (73K) اور Previous (106K) دونوں سے کم ہے۔\nیہ ظاہر کرتا ہے کہ لیبر مارکیٹ سست ہو رہی ہے۔\nDollar (USD): کمزور ہوا کیونکہ کمزور روزگار رپورٹ سے Fed کے لیے سود کی شرح بڑھانا مشکل ہو گیا۔\nGold (XAU): مضبوط ہوا کیونکہ سرمایہ کار Safe Haven (سونا) کی طرف گئے۔\nRisk Mode: مارکیٹ Risk Off کی حالت میں گئی کیونکہ انویسٹر نے رسکی اثاثوں سے پیسہ نکال کر محفوظ سرمایہ کاری میں منتقل کیا۔"
  },
  {
    "date": "Fri, Sep 4 2025 8:30 AM",
    "currency": "USD",
    "report": "Unemployment Claims",
    "actual": "237K",
    "forecast": "230K",
    "previous": "229K",
    "marketImpact": "Actual Forecast سے زیادہ → Labor Market Cooling",
    "dollar": "Weak (down)",
    "gold": "Strong (up)",
    "riskMode": "❌ Risk Off",
    "imageId": "1rIj1EPPmau1wC5RABQCaIRhWEaE9RFg8",
    "explanation": "Unemployment Claims رپورٹ ہر ہفتے ان لوگوں کی تعداد بتاتی ہے جو پہلی بار بے روزگاری الاؤنس کے لیے درخواست دیتے ہیں۔\nاگر یہ عدد زیادہ ہو تو مطلب لیبر مارکیٹ کمزور ہو رہی ہے، اور اگر کم ہو تو روزگار مضبوط ہے۔\nاس بار Actual 237K آیا جو Forecast (230K) اور Previous (229K) سے زیادہ ہے۔ یہ ظاہر کرتا ہے کہ زیادہ لوگ نوکریاں کھو رہے ہیں۔\nDollar (USD): کمزور ہوا کیونکہ لیبر مارکیٹ کی سست رفتاری سے Fed پر دباؤ بڑھ گیا کہ وہ سود کی شرح نہ بڑھائے۔\nGold (XAU): اوپر گیا کیونکہ سرمایہ کار Risk سے بچنے کے لیے Safe Haven یعنی سونا خرید رہے ہیں۔\nRisk Mode: مارکیٹ Risk Off کی حالت میں ہے کیونکہ انویسٹر خطرناک سرمایہ کاری سے دور جا رہے ہیں۔"
  },
  {
    "date": "Fri, Sep 4 2025 10:00 AM",
    "currency": "USD",
    "report": "ISM Services PMI",
    "actual": "52.0",
    "forecast": "50.9",
    "previous": "50.1",
    "marketImpact": "Actual 50 سے اوپر → Economy Expansion",
    "dollar": "Strong (up)",
    "gold": "Weak (down)",
    "riskMode": "✅ Risk On",
    "imageId": "18C2B0yIYnl0C223Fyj3_m50gMA94IpNj",
    "explanation": "ISM Services PMI رپورٹ امریکہ کے Service Sector (جیسے بینکنگ، ریٹیل، ٹرانسپورٹ وغیرہ) کی کارکردگی کو ظاہر کرتی ہے۔\nاگر نتیجہ 50 سے اوپر ہو تو یہ Expansion (ترقی) کو ظاہر کرتا ہے، جبکہ 50 سے نیچے ہو تو Contraction (سست روی) کو۔\nاس بار Actual 52.0 آیا جو Forecast (50.9) اور Previous (50.1) دونوں سے بہتر ہے — مطلب Service Sector میں بہتری دیکھی گئی۔\nDollar (USD): مضبوط ہوا کیونکہ اچھی Service Data سے Fed کو اعتماد ملا کہ معیشت ابھی بھی مضبوط ہے۔\nGold (XAU): نیچے گیا کیونکہ سرمایہ کاروں نے Risk Assets (جیسے اسٹاکس) میں سرمایہ کاری بڑھائی۔\nRisk Mode: مارکیٹ میں Risk On حالت دیکھی گئی کیونکہ معیشت کے بہتر اشارے سے سرمایہ کاروں کا اعتماد بحال ہوا۔"
  },
  {
    "date": "Fri, Sep 5 2025 8:30 AM",
    "currency": "USD",
    "report": "Average Hourly Earnings m/m",
    "actual": "0.3%",
    "forecast": "0.3%",
    "previous": "0.3%",
    "marketImpact": "Actual Forecast کے برابر → Neutral Impact",
    "dollar": "Stable (neutral)",
    "gold": "Stable (neutral)",
    "riskMode": "⚖️ Neutral",
    "imageId": "1MFGoYlv8p5QwBkBaO7iBWOI50O9Yy-Ij",
    "explanation": "Average Hourly Earnings رپورٹ مزدوروں کی فی گھنٹہ تنخواہ میں ماہانہ تبدیلی بتاتی ہے۔\nیہ رپورٹ افراطِ زر (Inflation) اور لیبر مارکیٹ کی مضبوطی کا اندازہ لگانے میں مدد دیتی ہے۔\nاس بار نتیجہ 0.3% آیا جو Forecast اور Previous دونوں کے برابر ہے، اس کا مطلب ہے کہ اجرتوں میں کوئی خاص تبدیلی نہیں ہوئی۔\nDollar (USD): مستحکم رہا کیونکہ کوئی حیران کن نتیجہ نہیں آیا۔\nGold (XAU): زیادہ اثر نہیں ہوا، قیمت تقریباً وہی رہی۔\nRisk Mode: مارکیٹ Neutral رہی کیونکہ ڈیٹا نے کسی واضح سمت کا اشارہ نہیں دیا۔"
  },
  {
    "date": "Fri, Sep 5 2025 8:30 AM",
    "currency": "USD",
    "report": "Non-Farm Employment Change",
    "actual": "22K",
    "forecast": "75K",
    "previous": "79K",
    "impact": "Strong",
    "marketImpact": "Actual Forecast سے بہت کم → Major Weakness in Labor Market",
    "dollar": "Weak (down)",
    "gold": "Strong (up)",
    "riskMode": "❌ Risk Off",
    "imageId": "1MFGoYlv8p5QwBkBaO7iBWOI50O9Yy-Ij",
    "explanation": "Non-Farm Employment Change رپورٹ امریکہ میں کل نئی ملازمتوں (Agriculture کے علاوہ) کی تعداد بتاتی ہے۔\nیہ رپورٹ مارکیٹ کے لیے سب سے زیادہ اہم اقتصادی اشاروں میں سے ایک ہے۔\nاس بار Actual صرف 22K آیا جو Forecast (75K) اور Previous (79K) دونوں سے کافی کم ہے۔\nیہ ظاہر کرتا ہے کہ امریکہ کی لیبر مارکیٹ میں بڑی سست روی آئی ہے۔\nDollar (USD): کمزور ہوا کیونکہ روزگار کے کمزور ڈیٹا سے اقتصادی دباؤ بڑھا۔\nGold (XAU): مضبوط ہوا کیونکہ سرمایہ کاروں نے Safe Haven کی طرف رجحان اختیار کیا۔\nRisk Mode: مارکیٹ مکمل طور پر Risk Off میں گئی کیونکہ کمزور روزگار ڈیٹا سے ریسیشن کے خدشات بڑھ گئے۔"
  },
  {
    "date": "Fri, Sep 5 2025 8:30 AM",
    "currency": "USD",
    "report": "Unemployment Rate",
    "actual": "4.3%",
    "forecast": "4.3%",
    "previous": "4.2%",
    "impact": "Strong",
    "marketImpact": "Actual Forecast کے برابر لیکن Previous سے زیادہ → Slight Weakness in Labor Market",
    "dollar": "Neutral to Weak",
    "gold": "Slightly Strong",
    "riskMode": "⚠️ Mild Risk Off",
    "imageId": "1MFGoYlv8p5QwBkBaO7iBWOI50O9Yy-Ij",
    "explanation": "Unemployment Rate وہ رپورٹ ہے جو بتاتی ہے کہ ملک میں کتنے لوگ بے روزگار ہیں۔\nزیادہ ریٹ کمزور لیبر مارکیٹ کو ظاہر کرتا ہے، جب کہ کم ریٹ مضبوط معیشت کی نشانی ہوتا ہے۔\nاس بار Unemployment Rate 4.3% آیا جو Forecast کے برابر لیکن Previous (4.2%) سے تھوڑا زیادہ ہے۔\nیہ ظاہر کرتا ہے کہ روزگار کی رفتار تھوڑی سست ہوئی ہے۔\nDollar (USD): معمولی کمزور ہوا کیونکہ مارکیٹ نے لیبر مارکیٹ میں سستی محسوس کی۔\nGold (XAU): تھوڑا مضبوط ہوا کیونکہ سرمایہ کاروں نے محتاط رویہ اختیار کیا۔\nRisk Mode: مارکیٹ ہلکی Risk Off حالت میں رہی کیونکہ انویسٹر نے Safe Assets میں دلچسپی بڑھائی۔"
  },
  {
    "date": "Wed, Sep 10 2025 8:30 AM",
    "currency": "USD",
    "report": "Core PPI m/m",
    "actual": "-0.1%",
    "forecast": "0.3%",
    "previous": "0.7%",
    "impact": "Strong",
    "marketImpact": "Actual Forecast سے بہت کم → Inflation Pressure Down",
    "dollar": "Weak (down)",
    "gold": "Strong (up)",
    "riskMode": "❌ Risk Off",
    "imageId": "1JCaqjv4-2eti7MdrQFKRHD6fMiJIq97I",
    "explanation": "Core PPI (Producer Price Index) m/m رپورٹ پیداوار کی سطح پر قیمتوں میں ماہانہ تبدیلی کو ظاہر کرتی ہے۔ یہ افراطِ زر (Inflation) کی ایک اہم پیمائش ہے۔\nاس بار Core PPI -0.1% آیا، جو Forecast (0.3%) اور Previous (0.7%) دونوں سے کم ہے۔\nیہ ظاہر کرتا ہے کہ افراطِ زر کم ہو رہی ہے اور قیمتوں میں دباؤ کم ہے۔\nDollar (USD): کمزور ہوا کیونکہ کمزور افراطِ زر سے Fed کو شرحِ سود کم رکھنے کی گنجائش ملی۔\nGold (XAU): مضبوط ہوا کیونکہ کمزور ڈالر نے سونا سرمایہ کاروں کے لیے پرکشش بنا دیا۔\nRisk Mode: مارکیٹ Risk Off رہی کیونکہ سرمایہ کاروں نے محتاط رویہ اختیار کیا۔"
  }
]
